load_output.log
/opt/homebrew/opt/openjdk@21/bin/java  -classpath /Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/conf:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/core/target/core-0.18.0-shivam-SNAPSHOT.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/core/target/dependency/HdrHistogram-2.1.12.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/core/target/dependency/bsh-2.0b4.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/core/target/dependency/jackson-core-asl-1.9.4.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/core/target/dependency/jcommander-1.12.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/core/target/dependency/junit-3.8.1.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/core/target/dependency/snakeyaml-1.6.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/core/target/dependency/testng-6.1.1.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/conf:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dynamodb-binding-0.18.0-shivam-SNAPSHOT.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-accessanalyzer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-acm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-acmpca-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-alexaforbusiness-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-amplify-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-api-gateway-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-apigatewaymanagementapi-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-apigatewayv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-appconfig-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-applicationautoscaling-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-applicationinsights-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-appmesh-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-appstream-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-appsync-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-athena-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-augmentedairuntime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-autoscaling-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-autoscalingplans-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-backup-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-batch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-budgets-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-chime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-cloud9-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-clouddirectory-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-cloudformation-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-cloudfront-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-cloudhsm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-cloudhsmv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-cloudsearch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-cloudtrail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-cloudwatch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-cloudwatchmetrics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-codeartifact-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-codebuild-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-codecommit-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-codedeploy-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-codeguruprofiler-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-codegurureviewer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-codepipeline-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-codestar-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-codestarconnections-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-codestarnotifications-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-cognitoidentity-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-cognitoidp-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-cognitosync-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-comprehend-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-comprehendmedical-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-computeoptimizer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-config-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-connect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-connectparticipant-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-core-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-costandusagereport-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-costexplorer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-dataexchange-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-datapipeline-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-datasync-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-dax-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-detective-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-devicefarm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-directconnect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-directory-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-discovery-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-dlm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-dms-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-docdb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-dynamodb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-ebs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-ec2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-ec2instanceconnect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-ecr-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-ecs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-efs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-eks-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-elasticache-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-elasticbeanstalk-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-elasticinference-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-elasticloadbalancing-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-elasticloadbalancingv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-elasticsearch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-elastictranscoder-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-emr-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-eventbridge-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-events-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-fms-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-forecast-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-forecastquery-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-frauddetector-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-fsx-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-gamelift-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-glacier-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-globalaccelerator-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-glue-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-greengrass-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-groundstation-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-guardduty-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-health-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-honeycode-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-iam-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-imagebuilder-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-importexport-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-inspector-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-iot-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-iot1clickdevices-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-iot1clickprojects-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-iotanalytics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-iotevents-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-ioteventsdata-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-iotjobsdataplane-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-iotsecuretunneling-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-iotsitewise-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-iotthingsgraph-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-kafka-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-kendra-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-kinesis-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-kinesisanalyticsv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-kinesisvideo-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-kinesisvideosignalingchannels-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-kms-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-lakeformation-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-lambda-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-lex-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-lexmodelbuilding-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-licensemanager-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-lightsail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-logs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-machinelearning-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-macie-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-macie2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-managedblockchain-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-marketplacecatalog-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-marketplacecommerceanalytics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-marketplaceentitlement-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-marketplacemeteringservice-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-mechanicalturkrequester-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-mediaconnect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-mediaconvert-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-medialive-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-mediapackage-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-mediapackagevod-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-mediastore-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-mediastoredata-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-mediatailor-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-migrationhub-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-migrationhubconfig-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-mobile-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-models-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-mq-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-neptune-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-networkmanager-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-opsworks-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-opsworkscm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-organizations-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-outposts-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-personalize-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-personalizeevents-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-personalizeruntime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-pi-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-pinpoint-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-pinpointemail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-pinpointsmsvoice-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-polly-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-pricing-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-qldb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-qldbsession-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-quicksight-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-ram-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-rds-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-rdsdata-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-redshift-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-rekognition-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-resourcegroups-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-resourcegroupstaggingapi-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-robomaker-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-route53-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-route53resolver-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-s3-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-s3control-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-sagemaker-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-sagemakerruntime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-savingsplans-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-schemas-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-secretsmanager-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-securityhub-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-serverlessapplicationrepository-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-servermigration-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-servicecatalog-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-servicediscovery-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-servicequotas-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-ses-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-sesv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-shield-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-signer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-simpledb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-simpleworkflow-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-snowball-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-sns-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-sqs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-ssm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-sso-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-ssooidc-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-stepfunctions-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-storagegateway-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-sts-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-support-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-swf-libraries-1.11.22.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-synthetics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-textract-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-transcribe-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-transfer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-translate-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-waf-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-wafv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-workdocs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-worklink-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-workmail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-workmailmessageflow-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-workspaces-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/aws-java-sdk-xray-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/commons-codec-1.11.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/commons-logging-1.1.3.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/httpclient-4.5.9.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/httpcore-4.4.11.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/ion-java-1.0.2.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/jackson-annotations-2.6.0.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/jackson-core-2.6.7.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/jackson-databind-2.6.7.3.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/jackson-dataformat-cbor-2.6.7.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/jmespath-java-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/joda-time-2.8.1.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/log4j-1.2.17.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/netty-buffer-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/netty-codec-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/netty-codec-http-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/netty-common-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/netty-handler-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/netty-resolver-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db-benchmark/ycsb/dynamodb/target/dependency/netty-transport-4.1.44.Final.jar site.ycsb.Client -load -db site.ycsb.db.DynamoDBClient -P workloads/workload_dynamo_compat -p dynamodb.endpoint=http://localhost:8787/api -p dynamodb.primaryKey=PK -p dynamodb.primaryKeyType=HASH -p dynamodb.awsCredentialsFile=fake-aws-credentials.properties -s
Command line: -load -db site.ycsb.db.DynamoDBClient -P workloads/workload_dynamo_compat -p dynamodb.endpoint=http://localhost:8787/api -p dynamodb.primaryKey=PK -p dynamodb.primaryKeyType=HASH -p dynamodb.awsCredentialsFile=fake-aws-credentials.properties -s
YCSB Client 0.18.0-shivam-SNAPSHOT

Loading workload...
Starting test.
2026-02-13 19:23:01:843 0 sec: 0 operations; est completion in 0 second 
0    [Thread-2] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2026-02-13 19:23:06:572 4 sec: 1000 operations; 210.08 current ops/sec; [CLEANUP: Count=1, Max=1, Min=1, Avg=1, 50=1, 90=1, 99=1, 99.9=1, 99.99=1] [INSERT: Count=1000, Max=113151, Min=2130, Avg=4289.19, 50=3147, 90=6471, 99=19375, 99.9=53823, 99.99=113151] 
[OVERALL], RunTime(ms), 4760
[OVERALL], Throughput(ops/sec), 210.08403361344537
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 4
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.08403361344537816
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 4
[TOTAL_GC_TIME_%], Time(%), 0.08403361344537816
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1.0
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 1
[CLEANUP], 50thPercentileLatency(us), 1
[CLEANUP], 95thPercentileLatency(us), 1
[CLEANUP], 99thPercentileLatency(us), 1
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 4289.189
[INSERT], MinLatency(us), 2130
[INSERT], MaxLatency(us), 113151
[INSERT], 50thPercentileLatency(us), 3147
[INSERT], 95thPercentileLatency(us), 8511
[INSERT], 99thPercentileLatency(us), 19375
[INSERT], Return=OK, 1000